axf33480/ESP32CommandStation/main/WebServer.cpp
HTTP_HANDLER_IMPL(process_config, request)
{
  auto stackManager = Singleton<esp32cs::LCCStackManager>::instance();
  auto wifiManager = Singleton<esp32cs::LCCWiFiManager>::instance();
  bool needReboot = false;

  if (request->has_param("reset"))
  {
    stackManager->factory_reset();
    wifiManager->factory_reset();
    needReboot = true;
  }
  else if (request->has_param("scan"))
  {
    return new StringResponse(wifiManager->wifi_scan_json(true), MIME_TYPE_APPLICATION_JSON);
  }
  if (request->has_param("ssid"))
  {
    wifiManager->reconfigure_station(request->param("ssid"), request->param("password"));
    needReboot = true;
  }
  if (request->has_param("mode"))
  {
    wifiManager->reconfigure_mode(request->param("mode"));
    needReboot = true;
  }
  if (request->has_param("nodeid") &&
      stackManager->set_node_id(request->param("nodeid")))
  {
    needReboot = true;
  }
  if (request->has_param("lcc-can") &&
      stackManager->reconfigure_can(request->param("lcc-can", false)))
  {
    needReboot = true;
  }
  if (request->has_param("lcc-hub"))
  {
    configListener->reconfigure_lcc_hub(request->param("lcc-hub", false));
  }
  if (request->has_param("uplink-mode") &&
      request->has_param("uplink-service") &&
      request->has_param("uplink-manual") &&
      request->has_param("uplink-manual-port"))
  {
    // WiFi uplink settings do not require a reboot
    SocketClientParams::SearchMode mode =
      (SocketClientParams::SearchMode)request->param("uplink-mode"
        , SocketClientParams::SearchMode::AUTO_MANUAL);
    string uplink_service = request->param("uplink-service");
    uint16_t manual_port =
      request->param("uplink-manual-port", TcpClientDefaultParams::DEFAULT_PORT);
    string manual_host = request->param("uplink-manual");
    configListener->reconfigure_uplink(mode, uplink_service, manual_host
                                     , manual_port);
  }
  if (request->has_param("ops-short") &&
      request->has_param("ops-short-clear") &&
      request->has_param("ops-shutdown") &&
      request->has_param("ops-shutdown-clear") &&
      request->has_param("ops-thermal") &&
      request->has_param("ops-thermal-clear"))
  {
    configListener->reconfigure_hbridge(esp32cs::OPS_CDI_TRACK_OUTPUT_IDX
                                      , request->param("ops-short")
                                      , request->param("ops-short-clear")
                                      , request->param("ops-shutdown")
                                      , request->param("ops-shutdown-clear")
                                      , request->param("ops-thermal")
                                      , request->param("ops-thermal-clear"));
  }
  if (request->has_param("prog-short") &&
      request->has_param("prog-short-clear") &&
      request->has_param("prog-shutdown") &&
      request->has_param("prog-shutdown-clear"))
  {
    configListener->reconfigure_hbridge(esp32cs::PROG_CDI_TRACK_OUTPUT_IDX
                                      , request->param("prog-short")
                                      , request->param("prog-short-clear")
                                      , request->param("prog-shutdown")
                                      , request->param("prog-shutdown-clear"));
  }

  if (needReboot)
  {
    // send a string back to the client rather than SEND_GENERIC_RESPONSE
    // so we don't return prior to calling reboot.
    return new StringResponse("{restart:\"ESP32CommandStation Restarting!\"}"
                            , MIME_TYPE_APPLICATION_JSON);
  }

  string response =
    StringPrintf("{%s,%s,%s}", stackManager->get_config_json().c_str()
                , wifiManager->get_config_json().c_str()
                , configListener->get_config_json().c_str());
  return new StringResponse(response, MIME_TYPE_APPLICATION_JSON);
}

HTTP_HANDLER_IMPL(process_prog, request)
{
  request->set_status(HttpStatusCode::STATUS_OK);
  if (!request->has_param(JSON_PROG_ON_MAIN))
  {
    request->set_status(HttpStatusCode::STATUS_BAD_REQUEST);
  }
  else if (request->method() == HttpMethod::GET)
  {
    if (request->param(JSON_PROG_ON_MAIN, false))
    {
      request->set_status(HttpStatusCode::STATUS_NOT_ALLOWED);
    }
    else if (request->has_param(JSON_IDENTIFY_NODE))
    {
      int16_t decoderConfig = readCV(CV_NAMES::DECODER_CONFIG);
      if (decoderConfig > 0)
      {
        uint16_t decoderAddress = 0;
        string response = "{";
        if ((decoderConfig & DECODER_CONFIG_BITS::DECODER_TYPE) == DECODER_CONFIG_BITS::DECODER_TYPE)
        {
          uint8_t decoderManufacturer = readCV(CV_NAMES::DECODER_MANUFACTURER);
          int16_t addrMSB = readCV(CV_NAMES::ACCESSORY_DECODER_MSB_ADDRESS);
          int16_t addrLSB = readCV(CV_NAMES::SHORT_ADDRESS);
          if (addrMSB >= 0 && addrLSB >= 0)
          {
            if (decoderManufacturer == 0xA5)
            {
              // MERG uses 7 bit LSB
              decoderAddress = (uint16_t)(((addrMSB & 0x07) << 7) | (addrLSB & 0x7F));
            }
            else if(decoderManufacturer == 0x19)
            {
              // Team Digital uses 8 bit LSB and 4 bit MSB
              decoderAddress = (uint16_t)(((addrMSB & 0x0F) << 8) | addrLSB);
            }
            else
            {
              // NMRA spec shows 6 bit LSB
              decoderAddress = (uint16_t)(((addrMSB & 0x07) << 6) | (addrLSB & 0x1F));
            }
            response += StringPrintf("\"%s\":\"%s\",", JSON_ADDRESS_MODE_NODE
                                   , JSON_VALUE_LONG_ADDRESS);
          }
          else
          {
            LOG(WARNING, "Failed to read address MSB/LSB");
            request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
          }
        }
        else
        {
          if ((decoderConfig & DECODER_CONFIG_BITS::SHORT_OR_LONG_ADDRESS) == DECODER_CONFIG_BITS::SHORT_OR_LONG_ADDRESS)
          {
            int16_t addrMSB = readCV(CV_NAMES::LONG_ADDRESS_MSB_ADDRESS);
            int16_t addrLSB = readCV(CV_NAMES::LONG_ADDRESS_LSB_ADDRESS);
            if (addrMSB >= 0 && addrLSB >= 0)
            {
              decoderAddress = (uint16_t)(((addrMSB & 0xFF) << 8) | (addrLSB & 0xFF));
              response += StringPrintf("\"%s\":\"%s\",", JSON_ADDRESS_MODE_NODE
                                     , JSON_VALUE_LONG_ADDRESS);

